In [ ]:
#1 - Leia o CSV 'Filmes'em uma variável chamada df. Digite print(df) na próxima linha veja o que aparece.
import pandas as pd
df = pd.read_csv('Filmes.csv', encoding='UTF-8', sep=',')
print(df)

In [ ]:
#2 - Quando carregamos um novo DataFrame de um CSV, queremos saber como ele se parece.
#Se for um DataFrame pequeno, você pode exibi-lo digitando print(df).
#Se for um DataFrame maior, é útil poder inspecionar alguns itens sem precisar examinar o DataFrame inteiro.
# Mostre  as 5 primeiras linhas do DataFrame df.
print(df.head(), "\n")

# Mostre algumas estatísticas para cada coluna
#Estatísticas coluna 'ano' e 'nota_imdb'
print(df.describe(), "\n")

#Estatísticas coluna 'nome'
dfFilmesA = df[df.nome.str[0] == 'A']
print("Quantidade de filmes que começam com a letra \'A\':", len(dfFilmesA.nome))
dfFilmesH = df[df.nome.str[0] == 'H']
print("Quantidade de filmes que começam com a letra \'H\':", len(dfFilmesH.nome))

#Estatísticas coluna 'genero'
dfAcao    = df[df.genero == 'action']
print("Quantidade de filmes do gênero Ação:", len(dfAcao.genero))

In [40]:
#Selecionar colunas
#3 - Crie uma variável nomes_filmes que contenha somente os nomes dos filmes
#Depois de criar a variável de o comando print(nomes_filmes)
nomes_filmes = df['nome']
print(nomes_filmes)

0                                         Avatar
1                                 Jurassic World
2                                   The Avengers
3                                The Dark Knight
4      Star Wars: Episode I - The Phantom Menace
                         ...
215                                     Hannibal
216                          Catch Me If You Can
217                                    Big Daddy
218                                        Se7en
219                                        Seven
Name: nome, Length: 220, dtype: object

In [41]:
#Agora, você quer comparar os filmes através de suas notas 
#4 - Crie uma variável filmes_e_notas que contenha somente dos dados das colunas nome e nota_imdb
#Depois de criar a variável de o comando print(filmes_e_notas)
filmes_e_notas = df[['nome', 'nota_imdb']]
print(filmes_e_notas)

                                          nome  nota_imdb
0                                       Avatar        7.9
1                               Jurassic World        7.3
2                                 The Avengers        8.1
3                              The Dark Knight        9.0
4    Star Wars: Episode I - The Phantom Menace        6.6
..                                         ...        ...
215                                   Hannibal        6.7
216                        Catch Me If You Can        8.0
217                                  Big Daddy        6.4
218                                      Se7en        8.6
219                                      Seven        6.1

[220 rows x 2 columns]

In [43]:
#Selecionando linhas
#5 - Escreva um comando que mostre os 10 primeiros registros
filmes_e_notas[0:10]

                                        nome  nota_imdb
0                                     Avatar        7.9
1                             Jurassic World        7.3
2                               The Avengers        8.1
3                            The Dark Knight        9.0
4  Star Wars: Episode I - The Phantom Menace        6.6
5                                  Star Wars        8.7
6                    Avengers: Age of Ultron        7.9
7                      The Dark Knight Rises        8.5
8  Pirates of the Caribbean: Dead Mans Chest        7.3
9                                 Iron Man 3        7.3

In [44]:
#6 - Escreva um comando que mostre os 4 últimos registros do DataFrame
filmes_e_notas[-4:]

                    nome  nota_imdb
216  Catch Me If You Can        8.0
217            Big Daddy        6.4
218                Se7en        8.6
219                Seven        6.1

In [52]:
df2 = pd.DataFrame([
  [1, 'Parafuso de 3 polegadas', 0.5, 0.75],
  [2, 'Prego de duas polegadas', 0.10, 0.25],
  [3, 'Martelo', 3.00, 5.50],
  [4, 'Chave de fenda', 2.50, 3.00]
],
  columns=['id_do_produto', 'produto', 'custo_de_fabricacao', 'preco']
)
df2

   id_do_produto                  produto  custo_de_fabricacao  preco
0              1  Parafuso de 3 polegadas                  0.5   0.75
1              2  Prego de duas polegadas                  0.1   0.25
2              3                  Martelo                  3.0   5.50
3              4           Chave de fenda                  2.5   3.00

In [59]:
#7 - Adiciona ao df2 a coluna margem que é a diferença entre o preço e custo de fabricação
df2['margem'] = df2.preco - df2.custo_de_fabricacao
df2

   id_do_produto                  produto  custo_de_fabricacao  preco  margem
0              1  Parafuso de 3 polegadas                  0.5   0.75    0.25
1              2  Prego de duas polegadas                  0.1   0.25    0.15
2              3                  Martelo                  3.0   5.50    2.50
3              4           Chave de fenda                  2.5   3.00    0.50

In [61]:
#8 - Altere o nome da coluna ID do produto para ID e Produto para Descrição
df2.rename(columns={'id_do_produto' : 'id', 'produto' : 'descricao'}, inplace=True)
df2

   id                descricao  custo_de_fabricacao  preco  margem
0   1  Parafuso de 3 polegadas                  0.5   0.75    0.25
1   2  Prego de duas polegadas                  0.1   0.25    0.15
2   3                  Martelo                  3.0   5.50    2.50
3   4           Chave de fenda                  2.5   3.00    0.50

In [63]:
#Leia o CSV 'olimpíadas'em uma variável chamada df3.
#Examine o DataFrame para entender o conjunto de dados
df3 = pd.read_csv('olimpíadas.csv', encoding='UTF-8', sep=',')
df3

,ano,edicao,cidade_sede,pais,delegacao,equipe,id_atleta,nome_atleta,sexo,idade,altura,peso,esporte,evento,medalha
0,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Athletics,"Athletics Men's 1,500 metres",Gold
1,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Athletics,Athletics Men's 800 metres,Gold
2,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Athletics,Athletics Men's Marathon,NaN
3,1896,Summer,Athina,Australia,AUS,Australia/Great Britain,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Tennis,Tennis Men's Doubles,Bronze
4,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Tennis,Tennis Men's Singles,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
269713,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,133071,"Pei Lin ""Audrey"" Yong",F,21.0,156.0,50.0,Sailing,Sailing Women's Windsurfer,NaN
269714,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,133346,Yu Mengyu,F,26.0,166.0,50.0,Table Tennis,Table Tennis Women's Singles,NaN
269715,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,133346,Yu Mengyu,F,26.0,166.0,50.0,Table Tennis,Table Tennis Women's Team,NaN
269716,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,134826,Zhou Yihan,F,22.0,168.0,54.0,Table Tennis,Table Tennis Women's Team,NaN
269717,2016,Summer,Rio de Janeiro,NaN,TUV,Tuvalu,120422,Etimoni Timuani,M,24.0,184.0,72.0,Athletics,Athletics Men's 100 metres,NaN

In [14]:
#9 - Escreva um comando que mostre o nome dos atletas brasileiros com mais de 30 anos e do sexo masculino que participaram
#das olimpíadas a partir de 2012

In [ ]:
#10 - Crie uma variável media_idade que contenha a média de idade dos atletas brasileiros
#Depois de criar a variável de o comando print(media_idade)

In [ ]:
#11 - Escreva um comando que mostre o nome, idade e ano de participação do atleta brasileiro mais velho
#que participou dos jogos olimpícos

In [17]:
#12 - Escreva um comando que mostre o nome, o ano e idade do atleta brasileiro mais jovem a ganhar uma medalha de ouro.

In [ ]:
#13 - Crie uma variável total_pais que contenha o total de medalhas por pais
#Depois de criar a variável de o comando print(total_pais)

In [22]:
#Voltando ao primeiro DataFrame sobre filmes
#14 - Escreva um comando que mostre quais o generos de filmes estão disponíveis no DataFrame.
#Obs: Não é só mostrar a coluna gênero

In [1]:
#15 - Escreva um comando que apresente a média das notas dos filmes por ano.